Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: L<Mojo::HelloWorld> is the default L<Mojolicious> application, used mostly for testing.
ja: [[Mojo::HelloWorld]] is the default [[Mojolicious]] application, used mostly for testing.

source: L<Mojo::Home> inherits all methods from L<Mojo::File> and implements the following new ones.
ja: [[Mojo::Home]] inherits all methods from [[Mojo::File]] and implements the following new ones.

source: L<Mojo::Home> inherits all overloaded operators from L<Mojo::File>.
ja: [[Mojo::Home]] inherits all overloaded operators from [[Mojo::File]].

source: L<Mojo::Home> is a container for home directories based on L<Mojo::File>.
ja: [[Mojo::Home]] is a container for home directories based on [[Mojo::File]].

source: L<Mojo::IOLoop::Client> implements the following attributes.
ja: [[Mojo::IOLoop::Client]] implements the following attributes.

source: L<Mojo::IOLoop::Client> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::IOLoop::Client]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::IOLoop::Client> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::IOLoop::Client]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::IOLoop::Client> opens TCP/IP and UNIX domain socket connections for L<Mojo::IOLoop>.
ja: [[Mojo::IOLoop::Client]] opens TCP/IP and UNIX domain socket connections for [[Mojo::IOLoop]].

source: L<Mojo::IOLoop::Delay> adds flow-control helpers to L<Mojo::Promise>, which can help you avoid deep nested closures that often result from continuation-passing style.
ja: [[Mojo::IOLoop::Delay]] adds flow-control helpers to [[Mojo::Promise]], which can help you avoid deep nested closures that often result from continuation-passing style.

source: L<Mojo::IOLoop::Delay> inherits all attributes from L<Mojo::Promise>.
ja: [[Mojo::IOLoop::Delay]] inherits all attributes from [[Mojo::Promise]].

source: L<Mojo::IOLoop::Delay> inherits all methods from L<Mojo::Promise> and implements the following new ones.
ja: [[Mojo::IOLoop::Delay]] inherits all methods from [[Mojo::Promise]] and implements the following new ones.

source: L<Mojo::IOLoop::Server> accepts TCP/IP and UNIX domain socket connections for L<Mojo::IOLoop>.
ja: [[Mojo::IOLoop::Server]] accepts TCP/IP and UNIX domain socket connections for [[Mojo::IOLoop]].

source: L<Mojo::IOLoop::Server> implements the following attributes.
ja: [[Mojo::IOLoop::Server]] implements the following attributes.

source: L<Mojo::IOLoop::Server> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::IOLoop::Server]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::IOLoop::Server> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::IOLoop::Server]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::IOLoop::Stream> implements the following attributes.
ja: [[Mojo::IOLoop::Stream]] implements the following attributes.

source: L<Mojo::IOLoop::Stream> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::IOLoop::Stream]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::IOLoop::Stream> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::IOLoop::Stream]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::IOLoop::Stream> is a container for I/O streams used by L<Mojo::IOLoop>.
ja: [[Mojo::IOLoop::Stream]] is a container for I/O streams used by [[Mojo::IOLoop]].

source: L<Mojo::IOLoop::Subprocess> allows L<Mojo::IOLoop> to perform computationally expensive operations in subprocesses, without blocking the event loop.
ja: [[Mojo::IOLoop::Subprocess]] allows [[Mojo::IOLoop]] to perform computationally expensive operations in subprocesses, without blocking the event loop.

source: L<Mojo::IOLoop::Subprocess> implements the following attributes.
ja: [[Mojo::IOLoop::Subprocess]] implements the following attributes.

source: L<Mojo::IOLoop::Subprocess> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::IOLoop::Subprocess]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::IOLoop::Subprocess> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::IOLoop::Subprocess]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::IOLoop::TLS> implements the following attributes.
ja: [[Mojo::IOLoop::TLS]] implements the following attributes.

source: L<Mojo::IOLoop::TLS> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::IOLoop::TLS]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::IOLoop::TLS> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::IOLoop::TLS]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::IOLoop::TLS> negotiates TLS for L<Mojo::IOLoop>.
ja: [[Mojo::IOLoop::TLS]] negotiates TLS for [[Mojo::IOLoop]].

source: L<Mojo::IOLoop> implements the following attributes.
ja: [[Mojo::IOLoop]] implements the following attributes.

source: L<Mojo::IOLoop> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::IOLoop]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::IOLoop> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::IOLoop]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::IOLoop> is a very minimalistic event loop based on L<Mojo::Reactor>, it has been reduced to the absolute minimal feature set required to build solid and scalable non-blocking clients and servers.
ja: [[Mojo::IOLoop]] is a very minimalistic event loop based on [[Mojo::Reactor]], it has been reduced to the absolute minimal feature set required to build solid and scalable non-blocking clients and servers.

source: L<Mojo::JSON::Pointer> implements the following attributes.
ja: [[Mojo::JSON::Pointer]] implements the following attributes.

source: L<Mojo::JSON::Pointer> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::JSON::Pointer]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::JSON::Pointer> is an implementation of L<RFC 6901|http://tools.ietf.org/html/rfc6901>.
ja: [[Mojo::JSON::Pointer]] is an implementation of [[RFC 6901|http://tools.ietf.org/html/rfc6901]].

source: L<Mojo::JSON> implements the following functions, which can be imported individually.
ja: [[Mojo::JSON]] implements the following functions, which can be imported individually.

source: L<Mojo::JSON> is a minimalistic and possibly the fastest pure-Perl implementation of L<RFC 8259|http://tools.ietf.org/html/rfc8259>.
ja: [[Mojo::JSON]] is a minimalistic and possibly the fastest pure-Perl implementation of [[RFC 8259|http://tools.ietf.org/html/rfc8259]].

source: L<Mojo::Loader> implements the following functions, which can be imported individually.
ja: [[Mojo::Loader]] implements the following functions, which can be imported individually.

source: L<Mojo::Loader> is a class loader and plugin framework.
ja: [[Mojo::Loader]] is a class loader and plugin framework.

source: L<Mojo::Log> implements the following attributes.
ja: [[Mojo::Log]] implements the following attributes.

source: L<Mojo::Log> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::Log]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::Log> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::Log]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::Log> is a simple logger for L<Mojo> projects.
ja: [[Mojo::Log]] is a simple logger for [[Mojo]] projects.

source: L<Mojo::Message::Request> inherits all attributes from L<Mojo::Message> and implements the following new ones.
ja: [[Mojo::Message::Request]] inherits all attributes from [[Mojo::Message]] and implements the following new ones.

source: L<Mojo::Message::Request> inherits all events from L<Mojo::Message>.
ja: [[Mojo::Message::Request]] inherits all events from [[Mojo::Message]].

source: L<Mojo::Message::Request> inherits all methods from L<Mojo::Message> and implements the following new ones.
ja: [[Mojo::Message::Request]] inherits all methods from [[Mojo::Message]] and implements the following new ones.

source: L<Mojo::Message::Request> is a container for HTTP requests, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230>, L<RFC 7231|http://tools.ietf.org/html/rfc7231>, L<RFC 7235|http://tools.ietf.org/html/rfc7235> and L<RFC 2817|http://tools.ietf.org/html/rfc2817>.
ja: [[Mojo::Message::Request]] is a container for HTTP requests, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]], [[RFC 7231|http://tools.ietf.org/html/rfc7231]], [[RFC 7235|http://tools.ietf.org/html/rfc7235]] and [[RFC 2817|http://tools.ietf.org/html/rfc2817]].

source: L<Mojo::Message::Response> inherits all attributes from L<Mojo::Message> and implements the following new ones.
ja: [[Mojo::Message::Response]] inherits all attributes from [[Mojo::Message]] and implements the following new ones.

source: L<Mojo::Message::Response> inherits all events from L<Mojo::Message>.
ja: [[Mojo::Message::Response]] inherits all events from [[Mojo::Message]].

source: L<Mojo::Message::Response> inherits all methods from L<Mojo::Message> and implements the following new ones.
ja: [[Mojo::Message::Response]] inherits all methods from [[Mojo::Message]] and implements the following new ones.

source: L<Mojo::Message::Response> is a container for HTTP responses, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230> and L<RFC 7231|http://tools.ietf.org/html/rfc7231>.
ja: [[Mojo::Message::Response]] is a container for HTTP responses, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]] and [[RFC 7231|http://tools.ietf.org/html/rfc7231]].

source: L<Mojo::Message> implements the following attributes.
ja: [[Mojo::Message]] implements the following attributes.

source: L<Mojo::Message> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::Message]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::Message> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::Message]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::Message> is an abstract base class for HTTP message containers, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230>, L<RFC 7231|http://tools.ietf.org/html/rfc7231> and L<RFC 2388|http://tools.ietf.org/html/rfc2388>, like L<Mojo::Message::Request> and L<Mojo::Message::Response>.
ja: [[Mojo::Message]] is an abstract base class for HTTP message containers, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]], [[RFC 7231|http://tools.ietf.org/html/rfc7231]] and [[RFC 2388|http://tools.ietf.org/html/rfc2388]], like [[Mojo::Message::Request]] and [[Mojo::Message::Response]].

source: L<Mojo::Parameters> implements the following attributes.
ja: [[Mojo::Parameters]] implements the following attributes.

source: L<Mojo::Parameters> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Parameters]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Parameters> is a container for form parameters used by L<Mojo::URL>, based on L<RFC 3986|http://tools.ietf.org/html/rfc3986> and the L<HTML Living Standard|https://html.spec.whatwg.org>.
ja: [[Mojo::Parameters]] is a container for form parameters used by [[Mojo::URL]], based on [[RFC 3986|http://tools.ietf.org/html/rfc3986]] and the [[HTML Living Standard|https://html.spec.whatwg.org]].

source: L<Mojo::Parameters> overloads the following operators.
ja: [[Mojo::Parameters]] overloads the following operators.

source: L<Mojo::Path> implements the following attributes.
ja: [[Mojo::Path]] implements the following attributes.

source: L<Mojo::Path> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Path]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Path> is a container for paths used by L<Mojo::URL>, based on L<RFC 3986|http://tools.ietf.org/html/rfc3986>.
ja: [[Mojo::Path]] is a container for paths used by [[Mojo::URL]], based on [[RFC 3986|http://tools.ietf.org/html/rfc3986]].

source: L<Mojo::Path> overloads the following operators.
ja: [[Mojo::Path]] overloads the following operators.

source: L<Mojo::Promise> implements the following attributes.
ja: [[Mojo::Promise]] implements the following attributes.

source: L<Mojo::Promise> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Promise]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Promise> is a Perl-ish implementation of L<Promises/A+|https://promisesaplus.com>.
ja: [[Mojo::Promise]] is a Perl-ish implementation of [[Promises/A+|https://promisesaplus.com]].

source: L<Mojo::Reactor::EV> inherits all events from L<Mojo::Reactor::Poll>.
ja: [[Mojo::Reactor::EV]] inherits all events from [[Mojo::Reactor::Poll]].

source: L<Mojo::Reactor::EV> inherits all methods from L<Mojo::Reactor::Poll> and implements the following new ones.
ja: [[Mojo::Reactor::EV]] inherits all methods from [[Mojo::Reactor::Poll]] and implements the following new ones.

source: L<Mojo::Reactor::EV> is a low-level event reactor based on L<EV> (4.0+).
ja: [[Mojo::Reactor::EV]] is a low-level event reactor based on [[EV]] (4.0+).

source: L<Mojo::Reactor::Poll> inherits all events from L<Mojo::Reactor>.
ja: [[Mojo::Reactor::Poll]] inherits all events from [[Mojo::Reactor]].

source: L<Mojo::Reactor::Poll> inherits all methods from L<Mojo::Reactor> and implements the following new ones.
ja: [[Mojo::Reactor::Poll]] inherits all methods from [[Mojo::Reactor]] and implements the following new ones.

source: L<Mojo::Reactor::Poll> is a low-level event reactor based on L<IO::Poll>.
ja: [[Mojo::Reactor::Poll]] is a low-level event reactor based on [[IO::Poll]].

source: L<Mojo::Reactor> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::Reactor]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::Reactor> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::Reactor]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::Reactor> is an abstract base class for low-level event reactors, like L<Mojo::Reactor::EV> and L<Mojo::Reactor::Poll>.
ja: [[Mojo::Reactor]] is an abstract base class for low-level event reactors, like [[Mojo::Reactor::EV]] and [[Mojo::Reactor::Poll]].

source: L<Mojo::Server::CGI> inherits all attributes from L<Mojo::Server> and implements the following new ones.
ja: [[Mojo::Server::CGI]] inherits all attributes from [[Mojo::Server]] and implements the following new ones.

source: L<Mojo::Server::CGI> inherits all events from L<Mojo::Server>.
ja: [[Mojo::Server::CGI]] inherits all events from [[Mojo::Server]].

source: L<Mojo::Server::CGI> inherits all methods from L<Mojo::Server> and implements the following new ones.
ja: [[Mojo::Server::CGI]] inherits all methods from [[Mojo::Server]] and implements the following new ones.

source: L<Mojo::Server::CGI> is a simple and portable implementation of L<RFC 3875|http://tools.ietf.org/html/rfc3875>.
ja: [[Mojo::Server::CGI]] is a simple and portable implementation of [[RFC 3875|http://tools.ietf.org/html/rfc3875]].

source: L<Mojo::Server::Daemon> inherits all attributes from L<Mojo::Server> and implements the following new ones.
ja: [[Mojo::Server::Daemon]] inherits all attributes from [[Mojo::Server]] and implements the following new ones.

source: L<Mojo::Server::Daemon> inherits all events from L<Mojo::Server>.
ja: [[Mojo::Server::Daemon]] inherits all events from [[Mojo::Server]].

source: L<Mojo::Server::Daemon> inherits all methods from L<Mojo::Server> and implements the following new ones.
ja: [[Mojo::Server::Daemon]] inherits all methods from [[Mojo::Server]] and implements the following new ones.

source: L<Mojo::Server::Daemon> is a full featured, highly portable non-blocking I/O HTTP and WebSocket server, with IPv6, TLS, SNI, Comet (long polling), keep-alive and multiple event loop support.
ja: [[Mojo::Server::Daemon]] is a full featured, highly portable non-blocking I/O HTTP and WebSocket server, with IPv6, TLS, SNI, Comet (long polling), keep-alive and multiple event loop support.

source: L<Mojo::Server::Daemon> object this server manages.
ja: [[Mojo::Server::Daemon]] object this server manages.

source: L<Mojo::Server::Hypnotoad> can be configured with the following settings, see L<Mojolicious::Guides::Cookbook/"Hypnotoad"> for examples.
ja: [[Mojo::Server::Hypnotoad]] can be configured with the following settings, see [[Mojolicious::Guides::Cookbook/"Hypnotoad"]] for examples.

source: L<Mojo::Server::Hypnotoad> implements the following attributes.
ja: [[Mojo::Server::Hypnotoad]] implements the following attributes.

source: L<Mojo::Server::Hypnotoad> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Server::Hypnotoad]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Server::Hypnotoad> is a full featured, UNIX optimized, pre-forking non-blocking I/O HTTP and WebSocket server, built around the very well tested and reliable L<Mojo::Server::Prefork>, with IPv6, TLS, SNI, UNIX domain socket, Comet (long polling), keep-alive, multiple event loop and hot deployment support that just works.
ja: [[Mojo::Server::Hypnotoad]] is a full featured, UNIX optimized, pre-forking non-blocking I/O HTTP and WebSocket server, built around the very well tested and reliable [[Mojo::Server::Prefork]], with IPv6, TLS, SNI, UNIX domain socket, Comet (long polling), keep-alive, multiple event loop and hot deployment support that just works.

source: L<Mojo::Server::Hypnotoad> worker processes can be controlled at runtime with the following signals.
ja: [[Mojo::Server::Hypnotoad]] worker processes can be controlled at runtime with the following signals.

source: L<Mojo::Server::Morbo::Backend::Poll> inherits all attributes from L<Mojo::Server::Morbo::Backend>.
ja: [[Mojo::Server::Morbo::Backend::Poll]] inherits all attributes from [[Mojo::Server::Morbo::Backend]].

source: L<Mojo::Server::Morbo::Backend::Poll> inherits all methods from L<Mojo::Server::Morbo::Backend> and implements the following new ones.
ja: [[Mojo::Server::Morbo::Backend::Poll]] inherits all methods from [[Mojo::Server::Morbo::Backend]] and implements the following new ones.

source: L<Mojo::Server::Morbo::Backend:Poll> is the default backend for L<Mojo::Server::Morbo>.
ja: [[Mojo::Server::Morbo::Backend:Poll]] is the default backend for [[Mojo::Server::Morbo]].

source: L<Mojo::Server::Morbo::Backend> implements the following attributes.
ja: [[Mojo::Server::Morbo::Backend]] implements the following attributes.

source: L<Mojo::Server::Morbo::Backend> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Server::Morbo::Backend]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Server::Morbo::Backend> is an abstract base class for Morbo backends, like L<Mojo::Server::Morbo::Backend::Poll>.
ja: [[Mojo::Server::Morbo::Backend]] is an abstract base class for Morbo backends, like [[Mojo::Server::Morbo::Backend::Poll]].

source: L<Mojo::Server::Morbo> implements the following attributes.
ja: [[Mojo::Server::Morbo]] implements the following attributes.

source: L<Mojo::Server::Morbo> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Server::Morbo]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Server::Morbo> is a full featured, self-restart capable non-blocking I/O HTTP and WebSocket server, built around the very well tested and reliable L<Mojo::Server::Daemon>, with IPv6, TLS, SNI, UNIX domain socket, Comet (long polling), keep-alive and multiple event loop support.
ja: [[Mojo::Server::Morbo]] is a full featured, self-restart capable non-blocking I/O HTTP and WebSocket server, built around the very well tested and reliable [[Mojo::Server::Daemon]], with IPv6, TLS, SNI, UNIX domain socket, Comet (long polling), keep-alive and multiple event loop support.

source: L<Mojo::Server::PSGI> allows L<Mojolicious> applications to run on all L<PSGI> compatible servers.
ja: [[Mojo::Server::PSGI]] allows [[Mojolicious]] applications to run on all [[PSGI]] compatible servers.

source: L<Mojo::Server::PSGI> can be used directly to load and customize applications in the wrapper script.
ja: [[Mojo::Server::PSGI]] can be used directly to load and customize applications in the wrapper script.

source: L<Mojo::Server::PSGI> inherits all attributes from L<Mojo::Server>.
ja: [[Mojo::Server::PSGI]] inherits all attributes from [[Mojo::Server]].

source: L<Mojo::Server::PSGI> inherits all events from L<Mojo::Server>.
ja: [[Mojo::Server::PSGI]] inherits all events from [[Mojo::Server]].

source: L<Mojo::Server::PSGI> inherits all methods from L<Mojo::Server> and implements the following new ones.
ja: [[Mojo::Server::PSGI]] inherits all methods from [[Mojo::Server]] and implements the following new ones.

source: L<Mojo::Server::Prefork> inherits all attributes from L<Mojo::Server::Daemon> and implements the following new ones.
ja: [[Mojo::Server::Prefork]] inherits all attributes from [[Mojo::Server::Daemon]] and implements the following new ones.

source: L<Mojo::Server::Prefork> inherits all events from L<Mojo::Server::Daemon> and can emit the following new ones.
ja: [[Mojo::Server::Prefork]] inherits all events from [[Mojo::Server::Daemon]] and can emit the following new ones.

source: L<Mojo::Server::Prefork> inherits all methods from L<Mojo::Server::Daemon> and implements the following new ones.
ja: [[Mojo::Server::Prefork]] inherits all methods from [[Mojo::Server::Daemon]] and implements the following new ones.

source: L<Mojo::Server::Prefork> is a full featured, UNIX optimized, pre-forking non-blocking I/O HTTP and WebSocket server, built around the very well tested and reliable L<Mojo::Server::Daemon>, with IPv6, TLS, SNI, UNIX domain socket, Comet (long polling), keep-alive and multiple event loop support.
ja: [[Mojo::Server::Prefork]] is a full featured, UNIX optimized, pre-forking non-blocking I/O HTTP and WebSocket server, built around the very well tested and reliable [[Mojo::Server::Daemon]], with IPv6, TLS, SNI, UNIX domain socket, Comet (long polling), keep-alive and multiple event loop support.

source: L<Mojo::Server::Prefork> object this server manages.
ja: [[Mojo::Server::Prefork]] object this server manages.
